/*
  Generated class for the DreamSourceProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/

export class DreamSourceProvider {

  constructor() { }

  /*
    戻り値：[{"name":"string", "items":[string[]]}]
  */
  getSegmentItems() {
    let segments = [
      {
        "name": "序文",
        "items": [`「ありがとう」という言葉は比較的耳にするとしても、「出逢えて良かった」という言葉は相手の人生に対して相当な感動やインパクトを与えないと出てこない言葉です。
          \n社員同士はお互いを自分の家族のように感じ、個性や役割を尊重し合い、苦楽を共にする関係を築いて、「三恵クリエスのメンバーで良かった」と言える関係を創りたい。
          \n私たちは神業の技術と、とびっきりの真心を込めたサービスを提供することで、お客様の本質的な課題を解決し、発展に大きく寄与して、「三恵クリエスさんに出逢えて良かった」と言われる会社になりたい。
          \n私たちが関わる全ての人と「出逢えて良かった」と言いあえるような関係を築いていくことが、私たちの夢であり、目指す理想のモデル企業です。`]
      },
      {
        "name": "Life Winner",
        "items": [`大志を抱き人生をかけて　継続的に努力し、決断した道を前進する人である。
          \n常に学び常に直面する障害を乗り越える方法を考え、実践する人である。
          \nまず自立し失敗しても他人のせいにせず、最後まで責任を取る人である。
          \n決断した道を進む過程を通じて、自分そして周囲の人に対しても感動と幸福を与える人である。`]
      },
      {
        "name": "Vision",
        "items": [`「あなたに出逢えて良かった」と言われるNo.1の企業グループになります。`]
      },
      {
        "name": "Mission",
        "items": [`First Step
          \n三恵クリエスは、社員の人格成長と専門スキル向上のために、必要な教育やチャンスを提供します。
          \nSecond Step
          \n三恵クリエスは、お客様の発展と幸福のために、ハートフルなITサービスを提供します。
          \nThird Step
          \n三恵クリエスは、「ありがとう」があふれる未来のために、「家族文化*」を発信し続けます。
          \n*お互いを自分の家族のように感じ、個性や役割を尊重し合い、苦楽を共にする関係`]
      },
      {
        "name": "基本原則１",
        "items": [`１．Dream Sourceは会社の心である\nDream Sourceは三恵クリエスの心であり魂であり、大切にしている価値観です。全員がこれを自分のものとして受け入れ理解し、主体的に実践します。全てのメンバーはDream Sourceを常に身につけ、迷いが生じた時には振り返ります。`]
      },
      {
        "name": "基本原則２",
        "items": [`２．動機を大切にする\n担当するプロジェクトや仕事の目的と意義を動機として、自らのエンジンを加速させ、期待される以上の成果を生み出していきます。`]
      },
      {
        "name": "基本原則３",
        "items": [`３．代表者意識\n全てのメンバーは会社の代表です。私達一人一人の言動によって、周囲の人はどのような会社か判断します。私達は本社勤務あるいは客先常駐であったとしても、プライベートの時間であったとしても、常に代表者意識を持ってDream Sourceに恥じない言動に努めます。`]
      },
      {
        "name": "基本原則４",
        "items": [`４．率先して責任を持つ\n私達は業務の目的を達成するために、率先して責任を持ち、主体的に提案・実行できる内容がないかを考え取り組みます。`]
      },
      {
        "name": "基本原則５",
        "items": [`５．目標を明確にする\n私達はチームの目標を共有し、お客様と目指す方向性や期待値の認識合わせをした上で、今やるべき事を明確にし、ゴールに向け前進していきます。`]
      },
      {
        "name": "基本原則６",
        "items": [`６．情熱と真剣さを持って最後までやり抜く\n私達は仕事に情熱と真剣さをもって取り組み、徹底して努力し続けます。どんな困難にぶつかっても例外を作らず、「私は必ず達成できる！」という確信と誇りを持って、最後までやり抜きます。`]
      },
      {
        "name": "基本原則７",
        "items": [`７．可能性を信じ、自己の限界に挑戦する\n挑戦することは時に勇気が必要ですが、困難を乗り越え達成した時こそ、人間として最高の喜びに出会うことができます。私達は、自らそして会社の可能性を信じて、日々自己の限界に挑戦します。`]
      },
      {
        "name": "基本原則８",
        "items": [`８．常に自らのスキルを磨く\n私達は社員同士、出逢ったお客様に対し、常に最高のサービスを提供し続けていくために、自分の生涯をかけてスキルを磨いていきます。`]
      },
      {
        "name": "基本原則９",
        "items": [`９．心を開く\n私達は社員同士、お客様に対して、心を開いて接し、素直に相手の考えや気持ちを理解することを大切にします。そうすることで、私達自身も相手に理解してもらうことができます。`]
      },
      {
        "name": "基本原則１０",
        "items": [`１０．メンバーを尊重しお互いの強みを共有する\n私達はチームメンバーを信じ、尊重し、協調性を持って仕事に取り組みます。そして一人一人がプロとして持っている「強み」「ノウハウ」「技術」「情熱」等を共有し、チーム全体の成果向上に取り組みます。`]
      },
      {
        "name": "基本原則１１",
        "items": [`１１．周囲に活力を与える\n私達は日々一緒に仕事をする仲間にストローク(*)を与えて、周囲を活性化していきます。私達は惜しみなくお客様の発展と幸福、そして一緒に仕事をするメンバーの喜びと成長のために全力を尽くします。\n*ストローク：心理学用語。相手の存在を認める全ての動作や働きかけ。具体的には人との「関わり」「フィードバック（行動に対する評価）」「刺激」のことを言います。挨拶、握手、視線を合わせるなどもその一種です。`]
      },
      {
        "name": "基本原則１２",
        "items": [`１２．良き助言を与えあう\n相手の成長と会社全体のために率直に意見を言い合います。言いにくいことでも、チームが、そして会社全体が最高の力を発揮するにはどうするべきかと考えて意見します。ただし、陰で批判したり、改善案の伴わない批判等々は絶対に認めません。`]
      },
    ];
    return segments;
  }

  /*
    戻り値：{"name":"string", "items":[string[]]}
  */
  getItem(name, num) {
    let item = {
      "name": name,
      "items": []
    };
    for (let i = 0; i < num; i++) {
      item.items.push("item" + i);
    }
    return item;
  }

}
